app/controllers/line_items_controller.rb

  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 207281424]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2017-02-28 23:49:35.966940"], ["updated_at", "2017-02-28 23:49:35.966940"]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 207281424], ["cart_id", 980190963], ["created_at", "2017-02-28 23:49:35.977606"], ["updated_at", "2017-02-28 23:49:35.977606"]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["quantity", 2], ["updated_at", "2017-02-27 17:44:48.230365"], ["id", 18]]