app/controllers/orders_controller.rb

INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2017-03-17 21:12:29.276020"], ["updated_at", "2017-03-17 21:12:29.276020"]]
INSERT INTO "orders" ("name", "address", "email", "pay_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "MyString"], ["address", "MyText"], ["email", "MyString"], ["pay_type", "MyString"], ["created_at", "2017-03-17 21:12:29.278175"], ["updated_at", "2017-03-17 21:12:29.278175"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 980190963]]
---
  def create
    @order = Order.new(order_params)
    @order.add_line_items_from_cart(@cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])